# This Brewfile only includes tools I expect to nearly always use
# Other, more specific tools may be guarded by `dotfiles_include()`
# calls in `install-macos.sh`
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "jandedobbeleer/oh-my-posh"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "coreutils"
brew "fish"
brew "gettext"
brew "git"
brew "libksba"
brew "libtool"
brew "libyaml"
brew "lzo"
brew "pass"
brew "pyenv"
brew "ripgrep"
brew "shpotify"
brew "zlib"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "mitmproxy"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-space-mono"
cask "font-space-mono-nerd-font"
cask "font-powerline-symbols"

# Other casks
cask "powershell"
cask "iterm2"
cask "spotify"
cask "visual-studio-code"
cask "vivaldi"